# language: ru

# Тестовые данные:

Функция: Добавление фруктов

  Сценарий: Добавление фруктов
    * страница "Главная страница" загружена
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Добавить"
    * страница "Страница добавления" загружена
    * поле "Наименование" заполняется значением "Абрикос"
    * выполнено нажатие на "Тип"
    * выполнено нажатие на "Фрукт"
    * выполнено нажатие на "Экзотический"
    * выполнено нажатие на "Сохранить"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Добавить"
    * страница "Страница добавления" загружена
    * поле "Наименование" заполняется значением "Слива"
    * выполнено нажатие на "Тип"
    * выполнено нажатие на "Фрукт"
    * выполнено нажатие на "Сохранить"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс"