# language: ru

# Тестовые данные:

Функция: Добавление овощей

  Сценарий: Добавление овощей
    * страница "Главная страница" загружена
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Добавить"
    * страница "Страница добавления" загружена
    * поле "Наименование" заполняется значением "Момордика"
    * выполнено нажатие на "Тип"
    * выполнено нажатие на "Овощ"
    * выполнено нажатие на "Экзотический"
    * выполнено нажатие на "Сохранить"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Добавить"
    * страница "Страница добавления" загружена
    * поле "Наименование" заполняется значением "Свекла"
    * выполнено нажатие на "Тип"
    * выполнено нажатие на "Овощ"
    * выполнено нажатие на "Сохранить"
    * страница "Страница товаров" загружена
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс"